// - Дано змінну time яка рівна числу від 0 до 59. Потрібно написати код,
// який перевірить, до якої четверті години попадає число
// (в першу, другу, третю или четверту частину години).


// let time = Math.floor(Math.random() * 59);
//
// if (time <= 15) {
//     console.log('Перша черга!!!')
// } else if (time <= 30 && time > 15) {
//     console.log('Друга черга!!!')
// } else if (time >30 && time <= 45) {
//     console.log('Третя черга!!!')
// } else if (time > 45 && time <= 59) {
//     console.log('Четверта черга!!!')
// }
//
// console.log(time);


// - У змінній day дано якесь число від 1 до 31. Потрібно визначити, у яку половину(декаду) місяця
// потрапляє це число (у першу, другу чи третю).

// let day = Math.floor(Math.random() * 31) + 1;
//
// if (day <= 10) {
//     console.log('Перша декада!')
// } else if (day > 10 && day <= 20) {
//     console.log('Друга декада')
// } else if (day > 20 && day <=31) {
//     console.log('Третя декада')
// }
// console.log(day);


// - У нас є змінна test, якщо не дорівнює true, виведіть 'Вірно', інакше виведіть 'Неправильно'.
//     Перевірте роботу скрипта при test, що дорівнює true, false.
//     Напишіть два варіанти скрипта - з коротким записом(тернаркою)

// let test = confirm();
//
// if (test !== true) {
//     console.log('Вірно');
// } else {
//     console.log('Неправильно');
// }

// let test = true;
//
// if (test === true) {
//     console.log('Неправильно');
// } else {
//     console.log('Вірно');
// }


// let test = false;
//
// if (test === true) {
//     console.log('Неправильно');
// } else {
//     console.log('Вірно');
// }


// let test =false;
// let xxx = test === true ? 'Неправильно' : 'Вірно';
// console.log(xxx);

// let test = true;
// let xxx = test === true ? 'Неправильно' : 'Вірно';
// console.log(xxx);


// let test = confirm() ? 'Неправильно' : 'Вірно';
// console.log(test);



// - Якщо змінна a не дорівнює нулю, виведіть 'Вірно', інакше виведіть 'Невірно'.
// Перевірте  скрипт при a, що дорівнює 1, 0, -3


// let a = +prompt('number');
// if (a !== 0 ) {
//     console.log('Вірно');
// } else {
//     console.log('Невірно');
// }


//
// - Скласти розклад на тиждень за домопоги switch. Користувач вводить порядковий номер дня тижня
// і на екрані відображається інфа що заплановано на цей день.

//
// let day = prompt('ввeдiть порядковий номер дня тижня (1 - 7)');
// switch (day) {
//     case '1':
//         console.log('Понеділок! Працювати , вчитись, трохи поспати))');
//         break;
//     case '2':
//         console.log('Вівторок! Працювати , вчитись, домашку робити, хоть трохи поспати))');
//         break;
//     case '3':
//         console.log('Середа! Працювати , дивитись лекцію, домашку робити, хоть трохи поспати))');
//         break;
//     case '4':
//         console.log('Четвер! Працювати , англійська, домашку робити, поспати))');
//         break;
//     case '5':
//         console.log('Пятниця! Працювати , дивитись лекцію, домашку робити, навряд чи висплюсь))');
//         break;
//     case '6':
//         console.log('Субота! Хотілось би відпочити. Але тре домашку робити, хоть трохи поспати))');
//         break;
//     case '7':
//         console.log('Неділя! Англійська , трохи прогулятись, домашку робити, хоть трохи поспати.');
//         break;
// }



// - Потрібно визначити Високосний рік чи ні. Високосні роки діляться націло на 4.

// let year = +prompt('write year');
// if (year % 4 === 0) {
//     console.log('Це високосний рік!!')
// } else {
//     console.log('Це не високосний рік!!')
// }


// - Використовуючи конструкцію if..else, напишіть код, який запитуватиме: „Яка «офіційна» назва JavaScript?“
// Якщо користувач вводить «ECMAScript», то показати: «Правильно!», інакше – відобразити: «Не знаєте? ECMAScript!

// let name = prompt('„Яка «офіційна» назва JavaScript?“');
// if (name === 'ECMAScript') {
//    console.log('Правильно!')
// } else {
//     console.log('Не знаєте? ECMAScript!')
// }


